app/controllers/register_controller.rb

INSERT INTO "preferences" ("created_at", "height", "primaryStyle", "secondaryStyle", "shoeSize", "size", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["created_at", "2014-11-09 04:03:11.164692"], ["height", 0], ["primaryStyle", "a"], ["secondaryStyle", "a"], ["shoeSize", 0.0], ["size", "a"], ["updated_at", "2014-11-09 04:03:11.164692"]]
---
  def create
    @preference = Preference.new(preference_params)

      respond_to do |format|
        if @preference.save

INSERT INTO "customers" ("created_at", "email", "password", "preference_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-11-09 21:29:55.066448"], ["email", "random@mail.com"], ["password", "psd"], ["preference_id", 92], ["updated_at", "2014-11-09 21:29:55.066448"]]
SELECT  "preferences".* FROM "preferences"  WHERE "preferences"."id" = ? LIMIT 1  [["id", 41]]
SELECT COUNT(*) FROM "preferences"  WHERE (69)
DELETE FROM "preferences" WHERE "preferences"."id" = ?  [["id", 41]]
---
  def registerCustomer

      @customer = Customer.new(params.require(:customer).permit(:email, :password))
      @customer.preference_id = @@id

      if @customer.save
      else
           if((Preference.where(@@id).empty?) != true)
	      Preference.find(@@id).destroy