app/controllers/register_controller.rb

  def registerCustomer

      if Preference.exists?(:id => @@id)

         @customer = Customer.new(params.require(:customer).permit(:email, :password))
         @customer.preference_id = @@id

         if @customer.save
            preference = Preference.find(@@id)
            preference.customer_id = @customer.id
            preference.save
---
UPDATE "preferences" SET "customer_id" = ?, "updated_at" = ? WHERE "preferences"."id" = 94  [["customer_id", 5], ["updated_at", "2014-11-09 21:38:42.467448"]]