app/controllers/style_controller.rb

INSERT INTO "preferences" ("created_at", "height", "primaryStyle", "secondaryStyle", "shoeSize", "size", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["created_at", "2014-11-02 05:43:56.225806"], ["height", 0], ["primaryStyle", "asd"], ["secondaryStyle", "asd"], ["shoeSize", 0.0], ["size", "asdas"], ["updated_at", "2014-11-02 05:43:56.225806"]]
---
  def create
		@preference = Preference.new(preference_params)

		respond_to do |format|
      if @preference.save